export interface VotingCandidate {
  id: string;
  name: string;
	description?: string;
	shortDescription?: string;
  image: string;
}

export interface Position {
  id: string;
  specialty: string;
  course: number;
  candidates: VotingCandidate[];
}

export interface CandidatesFaculty {
  id: string;
  name: string;
  positions: Position[];
}

export const allCandidatesData: CandidatesFaculty[] = [{
	id: 'philosophy-theology',
	name: 'Філософсько-Богословський',
	positions: [
		{
		id: 'bogoslov-ia-1',
		specialty: "Богослов'я",
		course: 1,
		candidates: [
			{
			id: '9',
			name: 'Коротушак Софія ',
			shortDescription: 'Пластунка Вірлиця, Салезіянська аніматорка. Була учасницею Молодіжної  Ради м.Бориспіль та учнівського самоврядування, в школі. Організувала більше 20 проєктів, всебічного характеру.',
			description: 'Готова взяти на себе відповідальність і доносити думки інших. Вважаю, що це буде гарний досвід особистісного зростання. Також хочу мати змогу здійснювати студентську політику на Всеуніверситетському рівні.',
			image: 'https://lh3.googleusercontent.com/d/1juGB2as_fkYofeh0wrnqdi2JBlo1JLp8'
			},
		]},
		{
		id: 'khristiians-ka-pedagogika-2',
		specialty: 'Християнська педагогіка',
		course: 2,
		candidates: [
			{
			id: '28',
			name: 'Шутка Іван-Ростислав',
			shortDescription: 'Студент магістерської програми «Християнська педагогіка та організація дозвілля», випускник Школи права УКУ, державний службовець',
			description: 'Маю досвід представництва інтересів групи. Був представником студентів у Вченій раді факультету. Розумію важливість комунікації і донесення позиції студентів щодо актуальних питань.',
			image: 'https://lh3.googleusercontent.com/d/1yFORVKGO4eTL0r91QEo6Gr9LOB8e2lb9'
			},
		]},
]},
{
	id: 'humanities',
	name: 'Гуманітарний',
	positions: [
		{
		id: 'filologiia-2',
		specialty: 'Філологія',
		course: 2,
		candidates: [
			{
			id: '18',
			name: 'Зоряна Хандон',
			shortDescription: 'Навчаюся на філології, обожнюю комунікації, книжки, волонтерство та все, що робить наше студентське життя яскравішим. Ви часто можете бачити мене за роботою над проєктами чи просто з кавою на кампусі. Я завжди відкрита до щирих розмов, нових ідей і прагну бути тією людиною, до якої можна вільно звернутися з будь-яким питанням!',
			description: 'Хочу бути представницею у Раді студентів, щоб наші голоси, ідеї та щоденні потреби не губилися, а перетворювалися на реальні дії. Завдяки досвіду в SMM та комунікаціях я вмію чітко доносити думки нашої спільноти та прозоро ділитися всім, що відбувається за кулісами. Обирати мене варто, якщо вам потрібна активна, надійна та відкрита людина, яка завжди поруч і готова підтримати кожну вашу ініціативу.',
			image: 'https://lh3.googleusercontent.com/d/10YiF2lbF13qMKSoI5KD7MTtHldxn85io'
			},
			{
			id: '29',
			name: 'Царенко Софія',
			shortDescription: 'Любі філологи та філологині, цьогоріч подаюся на посаду представниці нашої групи. Я щиро зацікавлена в долі нашої програми, тож готова докладати зусиль, аби наше навчання було насиченим та результативним. Саме тому я активно прагну вирішувати перешкоди, що можуть постати на нашому шляху, налагоджувати ефективну комунікацію та покращувати наші студентські будні. Сподіваюся на ваш голос!',
			description: 'Представництво — це, на мою думку, квінтесенція відповідальності та захисту інтересів моєї академічної групи. Для мене це можливість спробувати себе в лідерській ролі, займаючи важливу позицію в студентському самоврядуванні. Я прагну ефективно вирішувати труднощі, що потенційно виникатимуть на шляху нашої групи, а також активно долучатися до життя Ради. Саме тому подаюся на цю позицію.',
			image: 'https://lh3.googleusercontent.com/d/16XyZfWDT_YJQz7PmzBYoiQhFhuiVsMmj'
			},
		]},
		{
		id: 'istoriia-1',
		specialty: 'Історія',
		course: 1,
		candidates: [
			{
			id: '19',
			name: 'Макогоненко Анна-Марія ',
			shortDescription: 'Я люблю волейбол. Вже хочу щось робити, аби на волейбольному полі змінили сітку. Але не про це, я дуже люблю творчість і математику...  І загалом дуже багато чого люблю, тому як мінімум я буду прагнути змін і буду старатись їх втілити.',
			description: 'Я дуже люблю спілкуватись і відчуваю надмірну потребу самоцінності. Тому якщо виникнуть якісь проблеми, я буду дуже старатись вирішити цю проблему. А ще мені просто подобається перспектива більше спілкуватись з викладачами, звісно я не чоловік, і може виникнуть з деким проблеми, але я зроблю все можливе, аби цього не сталось.',
			image: 'https://lh3.googleusercontent.com/d/1tKiTGgM_D4TL2QdVuQuWgTkfO7H5HypL'
			},
			{
			id: '33',
			name: 'Шумейко Михайло ',
			shortDescription: 'Я комунікабельний та готовий завжди допомогти , дисциплінований. Вмію знаходити  компроміси в конфліктах, Поліглот, відповідальний, спортсмен',
			description: 'Моя мотивація стати старостою це залишити свій слід в унівеститеті , хочу сприяти якісній співпраці студентів і викладачів , мав досвід бути ком. відділення в війсковому ліцеї, тому маю навички дисциплінованості і організованості , сумлінно виконуватиму свої обовʼязки , стресостійкий та вмію опановувати себе в критичний ситуації, жо студентів ставитися не з позиції командувача, а з позиції рівного. Я вважаю , що зможу допомогти організувати навчалтний процесс.',
			image: 'https://lh3.googleusercontent.com/d/1F-ZXCVpY-XqOrTQAU6tcefhbaCn-Tmik'
			},
			{
			id: '46',
			name: 'Довженко Ростислав ',
			shortDescription: 'Я готовий робити те, що вам зробити лінь.\nЧерез свій, зокрема Пластовий, бекґраунд я доволі комфортно почуваю себе в критичних моментах та непогано комунікую з з іншими рівнями серед університетського суспільства.',
			description: 'Для мене навчання в Уку це про можливості розвитку.\nПредставництво – один з цих шансів проявити себе, взяти на себе відповідальність та познайомитися з іншими активними студентами.',
			image: 'https://lh3.googleusercontent.com/d/1P--jem_RuizAew3XOtNyI7W0A-pQBPgF'
			},
		]},
		{
		id: 'istoriia-2',
		specialty: 'Історія',
		course: 2,
		candidates: [
			{
			id: '25',
			name: 'Царелунга Анна ',
			shortDescription: 'Всім привіт! Мене звати Анна Царелунга. Навчаюся на 2-му курсі історії (як і всі мої виборці;).',
			description: 'Минулого року вже була передствницею академічної групи. Ця роль мені подобається, проте знаю що ще можу зробити роботу та комунікацію в групі кращою тому і подаюся на другий рік. Буду намагатися допомогти з усім, що є в межах моєї компетенції та обов’язків!',
			image: 'https://lh3.googleusercontent.com/d/1MUmzbSPXMN_IngLc8cMNtYetpeaNSdGw'
			},
		]},
		{
		id: 'istoriia-3',
		specialty: 'Історія',
		course: 3,
		candidates: [
			{
			id: '10',
			name: 'Чуб Ілля',
			shortDescription: 'Амбітний, неконфліктний, вирішую проблеми частіше, аніж їх створюю',
			description: 'Маю намір побудувати чітку та постійну комунікацію з між студентами моєї групи та викладачами, а також виступати людиною, котра збирає та агрегує важливу інформацію стосовно навчання і суспільних активностей, та доносить її студентам',
			image: 'https://lh3.googleusercontent.com/d/1O_Xeb4ubtuvs0ih_80GAmmuSd6O1kM1k'
			},
		]},
		{
		id: 'istoriia-4',
		specialty: 'Історія',
		course: 4,
		candidates: [
			{
			id: '40',
			name: 'Стемковський Марко',
			description: 'Треба вже добити цей стрік в 4 роки. \n\nЩо робив — робитиму.\nЩо треба буде зробити — зроблю. \nЩо не треба буде робити — не робитиму.',
			image: 'https://lh3.googleusercontent.com/d/1DmQQFshPY3sG1g87ppFri4n0gnnlW8CE'
			},
		]},
		{
		id: 'kul-turologiia-1',
		specialty: 'Культурологія',
		course: 1,
		candidates: [
			{
			id: '20',
			name: 'Синюта Уляна',
			shortDescription: 'Привіт-привіт!! Я Уляна і я люблю людей :) Навіть не знаючи усіх, я вже відчуваю, як наповнююсь енергією, коли перебуваю серед людей. Маю хороше почуття гумору: якщо захочете анекдот про зубочистку (їх цілих 4 штуки!) запрошую до спілкування 😛',
			description: 'Я відкрита до людей і до комунікації! Мені цікаво брати участь у спільних проєктах, мати певну відповідальність і я не боюсь висловлювати свою думку та боротися за неї.Також у мене є гостре відчуття справедливості, яке я б хотіла розкрити, будучи представницею культурологинь. Також я супер відкрита до нового і до змін у житті як інших, так і у своєму. Тому хочу бути дотичною до цих змін, і буду працювати над тим, щоб вони були на краще!',
			image: 'https://lh3.googleusercontent.com/d/1IWHU6riRG8LvdFju8LvgxWZ5zcGNxtuC'
			},
			{
			id: '49',
			name: 'Фомінська Тетяна',
			shortDescription: 'Привіт! Мене звати Тетяна, я першокурсниця програми Культурології. Творчість на наполегливість супроводжували мене протягом усього життя, зокрема у шкільні роки. Люблю працювати над новими ідеями, брати участь у різних ініціативах та відкривати для себе щось нове.',
			description: 'Мені хочеться спробувати себе в новій ролі та долучитися до активного життя УКУ. Завдяки творчості й досвіду участі в різних ініціативах я зрозуміла, що люблю бути частиною спільних проєктів. Хочу краще пізнати своїх одногрупників, чути їхні думки та разом створювати щось цікаве. Думаю, це хороша можливість проявити себе й бути корисною для нашої групи.',
			image: 'https://lh3.googleusercontent.com/d/15wlpFNkFle56sAxQg1v9LkU817dn3StI'
			},
		]},
		{
		id: 'kul-turologiia-2',
		specialty: 'Культурологія',
		course: 2,
		candidates: [
			{
			id: '22',
			name: 'Каленюк Ярина',
			shortDescription: 'привіт)\nмене звати Ярина, мені 18 років, я з міста Львів\nя комунікабельна, щира, трохи overthinker — проте відкрита до нових викликів та досвідів 🙌\nполюбляю спати, дивитися фільми, малювати, проводити час з людьми та вкидувати дурні жарти ;)\nА ще: в мене є кіт ☝️\n',
			description: 'Бути представницею групи для мене — це можливість бути голосом одногрупників і доносити наші спільні ідеї, пропозиції та потреби до керівництва. Мені важливо, щоб кожен з групи відчував себе комфортно у навчальному середовищі. Я відповідальна й готова діяти в інтересах усіх, аби зробити наше студентське життя активним, змістовним і приємним. \n+ за перший рік навчання я вже була представницею групи, делегаткою до Вченої ради факультету і частиною Комітету з питань комунікацій, мені це все щиро подобається, тому бажаю бути в Раді і надалі 👀',
			image: 'https://lh3.googleusercontent.com/d/1bRr3DMDKUIT0xHhKItrlmyGRXJ3yp2E1'
			},
		]},
		{
		id: 'kul-turologiia-4',
		specialty: 'Культурологія',
		course: 4,
		candidates: [
			{
			id: '17',
			name: 'Говорун Валерія',
			description: 'Хочу бути на посаді представниці нашої групи, щоб бути людиною, до якої завжди можна звернутися. Буду рада бути корисною нашій групі й зробити наше навчання трохи комфортнішим для всіх.',
			image: 'https://lh3.googleusercontent.com/d/1qYd7FLmJIr0ClbOIdAxrPvs_24AZehib'
			},
		]},
		{
		id: 'maibutnie-spadshchini-1',
		specialty: 'Майбутнє спадщини',
		course: 1,
		candidates: [
			{
			id: '45',
			name: 'Музика Богдана',
			shortDescription: 'Вітаю! Мене звати Богдана Музика, я студентка маґістерської програми «Майбутнє спадщини: історія, культура, література». Навчалася та стажувалась стажування в Німеччині. Цікавлюся історією, культурною спадщиною, політичною та інтелектуальною історією; також працюю перекладачкою з німецької мови.',
			description: 'Я маю намір бути посередницею між студентами та викладачами, оперативно комунікувати важливі питання, розвʼязувати можливі проблеми тощо. Вважаю, що маю для цього необхідні відповідальність, організованість і комунікаційні навички, набуті під час навчання та роботи в різних середовищах.',
			image: 'https://lh3.googleusercontent.com/d/1heYNlfFVPuc4FqFinFgUzkKsHBdPUor-'
			},
		]},
]},
{
	id: 'social-sciences',
	name: 'Суспільних Наук',
	positions: [
		{
		id: 'etika-politika-ekonomika-1',
		specialty: 'Етика-політика-економіка',
		course: 1,
		candidates: [
			{
			id: '4',
			name: 'Козак Маркіян ',
			shortDescription: 'Вітаю! Мене звуть Маркіян, мені 17. Навчаюсь на факультеті суспільних наук, програма ЕПЕ, перший курс. \nВ минулому, заступник президента школи, член ШРУП ТА УПЛ (Шевч. районний парламент, Учнівський Парламент Львова) \nЦікаво дізнатись, як працюють органи в УКУ та які зміни можна втілити. Дякую!',
			description: 'Я працьовитий, завзятий. \nКомунікативний, відкритий.\nВ минулому був учасником самоврядувань. \nБрав участь в заходах спрямованих на покращення взаємодії навчання. \nНавчаюсь на ЕПЕ, сподіваюсь ці знання допоможуть в роботі. \nВ майбутньому, сподіваюсь, буду повʼязувати свою карʼєру саме з такими органами. Тобто, ці знання, практика, досвід стануть в пригоді. \n',
			image: 'https://lh3.googleusercontent.com/d/1ene2sJ34EyuFzYXoMUI9In0qZJfth15G'
			},
			{
			id: '32',
			name: 'Сметана Юліана',
			shortDescription: 'Привіт)\nЯ Юліана, мені 18, я зі Львова\nМаю багато досвіду організації процесів, лідерства, роботи з людьми.\nЯ відповідальна і ініціативна людина, в якої завжди багато ідей і яка вміє ці ідеї реалізувати ;)',
			description: 'Я буду старостою, яка організовує все чітко й зрозуміло, щоб кожен знав, що відбувається і не було хаосу.\nДля мене важливо чути думку кожного та представляти інтереси всієї групи. \nТакож, ми з вами неодноразово чули, наскільки важливо проводити час разом, якщо ми хочемо стати дружнішими, тому я хочу організувати спільні зустрічі і поїздки.\nГолосуйте за мене)',
			image: 'https://lh3.googleusercontent.com/d/1aI1JcbGZiQgl4koaowgiAhz-WaRTDq2a'
			},
			{
			id: '50',
			name: 'Григоровський Юрій',
			shortDescription: 'Юра, 16 років, Львів. Раніше учасник Учнівського парламенту Львова, ведучий заходів у своєму ліцеї і просто активний учень який брав участь у десятках турнірів, олімпіад, вишколів і тд. Характером товариський - всіх вислухаю, що треба підкажу, чим треба поможу.',
			description: 'Раніше краяло серце те, що я забагато вагаюсь. Зараз подаючись на цю роль, в мене 0 вагань. Завжди бачив себе активним учасником спільноти наповненої людьми з вогником в очах і бажанням щось змінити. Так сталося що таку спільноту зустрів, це УКУ і мої одногрупники з ЕПЕшки.',
			image: 'https://lh3.googleusercontent.com/d/1MAQw2PIrKyomMzRE4IJJh1jDka2My83W'
			},
			{
			id: '54',
			name: 'Камілла Монастирська ',
			shortDescription: 'Слава Ісусу Христу, всім привіт, мене звати Камілла , мені 17 років , я з ФМТ :)  (Файного міста Тернопіль) та закінчила 6 школу, була в своєму класі заступницею старости та була в учнівському самоврядуванні, тому думаю мені добре вийде бути учасником студентського самоврядування . Люблю подорожувати(маю ціль об\'їздити всі країни, вже в скарбничці 19 країн), також захоплюсь читанням - особливо детективами та романами, закінчила художню школу та дуже люблю саме змальовувати якісь речі, я з тих людей, що перепробувала все можливо, тому думаю зі мною є про що поговорити. Цікавий факт про мене - я можу робити декілька речей одночасно, наприклад - читати, їсти та слухати когось.',
			description: 'Чому я хочу бути старостою?! Ну перш за все, я постійно стараюсь бути на звʼязку і думаю це дуже важливо для старости. Взагалом я дуже люблю процес організації роботи та вирішувати різноманітні питання та тримати ситуацію під контролем(навіть коли вже всі починають панікувати🥲). Я відповідальна, активна та не боюсь звернутись до викладача за якимось питанням(тому з легкістю зможете писати спочатку мені про свої побажання якщо що 🤗). Я справді дуже хочу створити круту атмосферу між нами, щоб всім було комфортно (завжди вислухаю та підтримую! Навіть якщо це не стосується навчання, буду вашим психологом, вважаю в цей час це потрібно 🥲). Обіцяю не зловживати владою !!! Хіба якщо дедлайн вже сьогодні, то буду нагадувати😁.',
			image: 'https://lh3.googleusercontent.com/d/1VLTcfFlv11BvU9Wje9TXdwE9UDZNL8zC'
			},
			{
			id: '55',
			name: 'Петрова Вікторія ',
			shortDescription: 'Я з тих людей, які не проходять повз, якщо бачать задачу, яку можна вирішити. Вважаю, що в нашому житті немає проблем, але є задачі, які просто чекають на правильний підхід. Люблю шукати цей підхід, пробувати нове й залучати людей навколо, бо найкращі ідеї рідко народжуються наодинці. Не боюся бути першою, хто скаже: «А чому б і ні?», навіть якщо спочатку ця ідея звучить божевільно. Мабуть, найбільше люблю момент, коли ще ніхто не знає, чи вийде, але вже є люди, які готові спробувати.',
			description: '\nЯ рухаюся по життю за принципом: «Я йду туди, де страшно, бо саме там живуть розвиток і розширення». Саме такого підходу хочу і для нашої групи: щоб ми не боялися братися за складне, пробувати те, чого ще не вміємо, помилятися, вставати й пробувати знову, виходити за межі того, що від нас очікують. Мені хочеться, щоб ми дозволяли собі більше - не завжди знати правильну відповідь, іноді ризикувати, ставити незручні запитання, придумувати власні правила й не боятися бути першими. Бо якщо ми вже опинилися в УКУ, було б шкода прожити цей досвід «на безпечному й комфортному режимі». Я хочу бути старостою саме для того, щоб разом із вами заходити туди, де ще немає протоптаної дороги, і залишати її після себе.',
			image: 'https://lh3.googleusercontent.com/d/17iMdC75tp-pWzIz3W1cFRSzpkxHs_ly2'
			},
		]},
		{
		id: 'etika-politika-ekonomika-2',
		specialty: 'Етика-політика-економіка',
		course: 2,
		candidates: [
			{
			id: '8',
			name: 'Ільчишин Вікторія ',
			shortDescription: 'Наразі є частинкою СО MUN Club, а також членкинею European Youth Parliament Ukraine. Трохи раніше була менторкою для перших курсів. Творча й комунікабельна натура, готова йти назустріч у всіх починаннях 🪄🫶',
			description: 'Дуже люблю працювати для людей і з радістю робила б це з нашою групою! Буду чесною: до обовʼязків підходжу відповідально та з ідеями. Комунікація з викладачами й кафедрою? Без питань! Просування ваших інтересів? Буде зроблено!\nЯ могла б купити 56 пачок гречки, та я не зробила б цього, і це не через штучний дефіцит в супермаркетах ;)))',
			image: 'https://lh3.googleusercontent.com/d/1q8R8H_EjGnnUoVyJjrSILupLfgiAbbYy'
			},
		]},
		{
		id: 'etika-politika-ekonomika-4',
		specialty: 'Етика-політика-економіка',
		course: 4,
		candidates: [
			{
			id: '57',
			name: 'Герман Ольга',
			shortDescription: 'За три роки навчання всі добре мене знають. Подаю свою кандидатуру, аби якісно продовжити те, що було почате  попередніми представниками і добре закінчити наше навчання.',
			description: 'гідно продовжити справу попередників',
			image: 'https://lh3.googleusercontent.com/d/1sS2NZAr8WCRao5LibtBLBRhQDAk4oynn'
			},
		]},
		{
		id: 'sotsiologiia-1',
		specialty: 'Соціологія',
		course: 1,
		candidates: [
			{
			id: '1',
			name: 'Качур Андрій',
			shortDescription: 'Мене звати Андрій.Я родом з Вінницької області.Дуже щасливий що поступив в УКУ!',
			description: 'Я балотуюся на посаду старости нашої групи з соціології, щоб допомагати студентам та представляти інтереси нашої групи. Хочу бути людиною, до якої можна звернутися з питанням чи проблемою та отримати допомогу. Також планую долучитися до Ради студентів УКУ і представляти там нашу групу. Буду вдячний за вашу довіру та підтримку.',
			image: 'https://lh3.googleusercontent.com/d/1hpw1LIAATsvwxS_-OZutz9bo8EDRj0xg'
			},
			{
			id: '56',
			name: 'Ревега Анастасія',
			shortDescription: 'люблю комунікувати з людьми, тому знайти з кимось спільку мову для мене не буде проблемою. також люблю допомагати іншим, братися за якісь ініціативи і реалізовувати їх. а ще обожнюю гори. того я просто в захваті від спонтанних ідей, і коли мені кажуть "було б класно" , є ймовірність того, що на наступний день воно вже буде класно:)',
			description: 'не люблю залишатися спостерігачем, адже якщо маю ідею чи проблему - я хочу шукати спосіб це змінити. маю досвід з рішенням організаційних питань, командної роботи і волонтерською справою. для мене рада - це можливіть представляти думки студентів, чути їхні потреби і старатися допомогти з реалізацією. саме тому я хочу бути тою людиною, до якої можна прийти не тіки з проблемою, а й з ідеями',
			image: 'https://lh3.googleusercontent.com/d/1yz3tb-u_eB-Ytbrs8txMR3eXwrH-HnLB'
			},
		]},
		{
		id: 'sotsiologiia-2',
		specialty: 'Соціологія',
		course: 2,
		candidates: [
			{
			id: '11',
			name: 'Ремізова Анастасія ',
			shortDescription: 'Неймовірно люблю Бога, людей, котиків, та дізнаватись щось нове! Народилась і все своє життя провела в Харкові. Трошки займаюсь дизайном, трошки співом і (не) трошки духовним місіонерством в К1.',
			description: 'Я прагну, щоб освітній процес для нашого курсу був не тяжким та приносив задоволення. Люблю чіткість в усіх справах та відповідально ставлюсь до завдань. Вірю, що я зможу допомогти побудувати спільноту, яка не боїться викликів та труднощів.',
			image: 'https://lh3.googleusercontent.com/d/10Jv88yqPm-KW5Zvkj3slHJmTD2Fq0BRi'
			},
		]},
		{
		id: 'publichne-upravlinnia-ta-administruvannia-1',
		specialty: 'Публічне управління та адміністрування',
		course: 1,
		candidates: [
			{
			id: '16',
			name: 'Козятинський Дмитро',
			shortDescription: 'Здобув ступінь бакалавра в НТУУ КПІ, потім 3 роки жив в Чехії, вчився на магістратурі в університеті Масарика та займався бізнесом в сфері кібербезпеки. Після початку повномасштабного вторгнення у 2022 році повернувся до України, долучився до штурмового взводу 47 ОМБр, пізніше до медичної служби Ульф батальйону "Вовки да Вінчі", де служив бойовим медиком. У 2025 звільнився зі служби та знову почав займатись бізнесом в сфері кібербезпеки, а також заснував маленьку будівельну компанію.\nІніціатор "картонкових" протестів 2025 і 2026 років.\nЗаймаюсь громадською діяльністю та волонтерством.',
			description: 'Хочу брати активну участь в житті університету та університетської спільноти, займатись організацією цікавих подій та загалом розвивати студентське самоврядування. Вважаю, що студентство є одним з ключових стовпів громадянського суспільства і його необхідно максимально підсилювати, тож прагну ділитися життєвим досвідом та проактивністю.',
			image: 'https://lh3.googleusercontent.com/d/1w2dQJhWrGIHnDDDjsS-k4ULqgdekVxXH'
			},
		]},
		{
		id: 'publichne-upravlinnia-ta-administruvannia-2',
		specialty: 'Публічне управління та адміністрування',
		course: 2,
		candidates: [
			{
			id: '27',
			name: 'Мануйленко Данило',
			shortDescription: 'І так усе знаєте ;)',
			description: '[Мотивацію було засекречено]',
			image: 'https://lh3.googleusercontent.com/d/10Z_6X_UbJXWbtr89t1MXrZOs_YT42uCZ'
			},
		]},
]},
{
	id: 'health-sciences',
	name: 'Наук про Здоровʼя',
	positions: [
		{
		id: 'sotsial-na-robota-1',
		specialty: 'Соціальна робота',
		course: 1,
		candidates: [
			{
			id: '13',
			name: 'Оленчук Яна',
			shortDescription: 'Мене звати Яна, я студентка першого курсу соціальної роботи. Я відкрита до нових знайомств, люблю працювати в команді, вмію відстоювати свою думку та водночас неутискати думку інших та не боюся брати на себе відповідальність. Для мене важливо, щоб поруч із людьми була підтримка і можливість бути почутими. Я завжди стараюся бути активною та долучатися до спільних справ.',
			description: 'Я хочу стати представницею групи, бо хочу бути людиною, до якої одногрупники можуть звернутися зі своїми ідеями, питаннями, пропозиціями чи проблемами. Мені подобається організовувати людей, комунікувати та шукати рішення, які будуть комфортними для всіх. Я відповідальна, уважна до думок інших і готова представляти інтереси нашої групи, а не лише власну позицію. Думаю, що зможу зробити нашу групу більш згуртованою та активною.',
			image: 'https://lh3.googleusercontent.com/d/1GL2unRiigiakvoyyfAD6bKN5GW28Xhmp'
			},
			{
			id: '31',
			name: 'Олещук Анастасія',
			shortDescription: 'Я студентка першого курсу соціальної роботи. У школі я була президенткою учнівського самоврядування, працювала з медіа, організовувала події та волонтерські ініціативи, а також координувала районне учнівське самоврядування. Мені подобається об’єднувати людей навколо спільних ідей, чути різні думки та шукати рішення, які справді працюють. В УКУ хочу не просто бути частиною спільноти, а активно розвивати її разом з іншими студентами.',
			description: 'Хочу стати представницею, бо мені справді цікаво бути людиною, яка може впливати на те, як розвивається наш курс і наша спеціальність. Я не хочу давати красивих обіцянок — натомість хочу бути на зв’язку, чути ваші думки та реально доносити їх до університету. У мене вже є досвід лідерства, комунікації та організації проєктів, і я хочу використати його тут, щоб наш курс був не просто ще однією групою студентів, а спільнотою, яку помічають і до якої прислухаються.',
			image: 'https://lh3.googleusercontent.com/d/1F4NNYsd_OIjl9IDwBotcI4zmNSJpmlEt'
			},
			{
			id: '34',
			name: 'Волик Ірина',
			shortDescription: 'Мене звати Ірина і я з Дніпра. Маю гарні лідерські якості, які хочу розвинути ставши представницею своєї спеціальності або факультету.',
			description: 'Я є помічником керівника скаутського табору і вже 7 років я скаут, тому знаю як бути відповідальною. Також, я оперативно виконую завдання, або організовую групу. Мені не байдуже на почуття інших і тому мені важливо, щоб всі почувалися добре в колективі.',
			image: 'https://lh3.googleusercontent.com/d/1B5hLFQBRYCFXNC9oaKt-4NErERkIwnZ5'
			},
		]},
		{
		id: 'sotsial-na-robota-2',
		specialty: 'Соціальна робота',
		course: 2,
		candidates: [
			{
			id: '3',
			name: 'Шлапак Олександра ',
			shortDescription: 'Привіт) Мене звати Олександра, навчаюсь на програмі «Соціальна робота», 2 курс. Люблю читати, грати у волейбол та кататися на сноуборді:) Загалом, мене приваблює волонтерство повʼязане з організацією, плануванням, тому я тут.',
			description: 'Я була представницею на першому курсі навчання. Мені є важливим досвід який я отримала минулого року і хочу продовжувати дотримувати його далі.',
			image: 'https://lh3.googleusercontent.com/d/1bR6biIkWXmczEwlHgAxLCSDSAClbfjw4'
			},
		]},
		{
		id: 'sotsial-na-robota-3',
		specialty: 'Соціальна робота',
		course: 3,
		candidates: [
			{
			id: '47',
			name: 'Єфіменко Русана',
			shortDescription: 'Я працюю з молоддю в ГО «10:11», а також для молоді в ГО «Земність», і бачу в цьому можливість підтримувати інших та формувати середовище для діалогу й відповідального громадянства. Моїм життєвим прикладом і натхненником є Мирослав Маринович, чий шлях демонструє силу принциповості, діалогу та служіння суспільству. Студентське самоврядування для мене є логічним продовженням громадської активності, якою я займаюся ще зі шкільних років. Рада студентів поєднує мої академічні зацікавлення з прагненням розвивати навички дипломатії, посередництва та представництва інтересів.',
			description: 'Одним із моїх особистих та академічних пріоритетів розвитку є дослідження та впровадження інклюзивних практик у закладах вищої освіти Європейського Союзу. У нашому Університеті вже функціонує сектор супроводу студентів з особливими освітніми потребами, проте досі відсутнє їхнє представництво в органах студентського самоврядування. Тому я прагну спільно із сектором, органами студентського самоврядування та іншими підрозділами УКУ сприяти створенню умов для їхнього активного представництва та участі в студентському житті.',
			image: 'https://lh3.googleusercontent.com/d/17eGt4kdzvjjgllgPKXDtAtN7B9H8ZWxd'
			},
		]},
		{
		id: 'sotsial-na-robota-4',
		specialty: 'Соціальна робота',
		course: 4,
		candidates: [
			{
			id: '48',
			name: 'Климус Марта',
			shortDescription: 'Марта, студентка 4 курсу програми соціальна робота. Беру активну участь у житті своєї програми, зокрема є частиною медіа команди, яка у соцмережах розповідає про особливості навчання та студентське життя. До моїх професійних інтересів входить розвиток соціальної роботи в Україні та робота у громадах, зокрема із молоддю. Люблю свою групу, передаю - ПРИВІТ!',
			description: 'Хочу робити навчальний процес і студентське життя нашої програми комфортним. Я добре розумію потреби нашої спільноти й вмію чути різні думки. А також вболіваю за розвиток нашої програми та добробут усієї групи.',
			image: 'https://lh3.googleusercontent.com/d/1TD3k6We147qxQDH70Sqenu7qLXjfeaE3'
			},
		]},
		{
		id: 'psikhologiia-3',
		specialty: 'Психологія',
		course: 3,
		candidates: [
			{
			id: '24',
			name: 'Дяків Влада',
			shortDescription: 'Привіт!! Я Влада, студентка 3-го курсу ОП "Психологія", а також паралельно студентка факультету культури й мистецтв у ЛНУ (вау, засланий козачок). Я займаюся переважно науковою стороною психології, є частиною науково-практичного товариства психологів, зараз працюю над публікацією своєї статті, а також залучена у відділі комунікації із випусниками нашого факультету. Поза навчанням цікавлюся розвитком культурної спадщини: третій рік є частиною СО "Мотанка", люблю подорожі на схід із Братством УКУ😇😇 та цікавлюся дисидентським рухом часів радянського союзу (курс Мокрика/Мариновича привіт).',
			description: 'Минулого року нам моментами не вистачало представника, тож я хотіла би бути людиною, до якої студенти могли б звернутися. Я відповідальна, комунікабельна, завжди присутня на парах, маю хороші стосунки з викладачами та студентами, а також широкий досвід організації та координації проєктів, наразі є лідером волонтерського проєкту у колегіумі. Тож, думаю, зможу гідно представляти інтереси своїх колег.',
			image: 'https://lh3.googleusercontent.com/d/1wRJkesAoqDZM9tbPzWmpjbBEGT7zd2V3'
			},
		]},
		{
		id: 'psikhologiia-4',
		specialty: 'Психологія',
		course: 4,
		candidates: [
			{
			id: '14',
			name: 'Хомич Анна',
			shortDescription: 'Я відповідальна, організована й комунікабельна людина, яка любить бути залученою в університетське життя та не боїться брати на себе ініціативу. Для мене важливо, щоб у групі кожен почувався почутим і знав, що може звернутися по допомогу чи підтримку. Вмію знаходити спільну мову з різними людьми, домовлятися та вирішувати організаційні питання.',
			description: 'Протягом останніх двох років я вже була представницею нашої групи, тому добре знаю, що передбачає ця роль і яку відповідальність вона за собою несе. Для мене особливо цінним є те, що одногрупники підтримують мене та хочуть, щоб я продовжувала представляти нашу групу й надалі. За цей час ми навчилися добре комунікувати та разом вирішувати різні організаційні питання, тож я хочу й надалі бути людиною, яка представляє інтереси групи та допомагає робити наше студентське життя комфортнішим.',
			image: 'https://lh3.googleusercontent.com/d/18gpVMkzGvjfNm006qWyF0CGG31TSm7G1'
			},
		]},
		{
		id: 'klinichna-psikhologiia-psikhodinamichna-terapiia-1',
		specialty: 'Клінічна психологія (психодинамічна терапія)',
		course: 1,
		candidates: [
			{
			id: '15',
			name: 'Коваль Анастасія',
			shortDescription: 'Мене звати Ася, протягом 4 років навчання на бакалавраті я була учасницею студентського самоврядування, Наукового та Літературного товариства свого університету. Найбільший досвід мені принесло перебування у Літературному товаристві, оскільки за час своєї діяльності там, я проводила щотижневі зустрічі поетів, внутрішні зустрічі команди, літературні квести, творчі майстер-класи, взяла участь в організації двох книжкових балів, котрі відбулися в оперному театрі та ботанічному саду, також влітку я організовувала виїзні засідання у гори та була учасницею журі всеукраїнського конкурсу для письменників. Я люблю комунікувати з людьми і разом створювати щось, що об\'єднує. Люблю людей, котрі зустрічаються на моєму шляху – вони прекрасні.',
			description: 'Мені важливо бути активною студенткою, що залучена у життя спільноти. Маючи досвід у студентському самоврядуванні та організації різноманітних заходів, я знаю, що мені близька роль людини, яка бере на себе відповідальність. Разом з тим, досвід очолення одного з відділів товариства та перебування на посаді заступниці приніс мені розуміння, що я не уявляю свого життя без командної роботи. Цей досвід навчив мене слухати, чути і дослухатися, а також створювати щось велике, маленьким внеском кожного учасника. Для мене представництво – це можливість робити свій внесок.',
			image: 'https://lh3.googleusercontent.com/d/1tEFDm_dzELB-Pip2iyuHSq-G9VYvKpo_'
			},
		]},
]},
{
	id: 'applied-sciences',
	name: 'Прикладних Наук',
	positions: [
		{
		id: 'komp-iuterni-nauki-1',
		specialty: "Комп'ютерні науки",
		course: 1,
		candidates: [
			{
			id: '26',
			name: 'Гридова Катерина ',
			shortDescription: 'Я завжди була людино, яка любить бути залученою в те, що відбувається навколо та шукати нові можливості. Я брала активну участь у різних проектах, олімпіадах, волонтерстві, програмах обміну, конкурсах та хакатонах, не лише на всеукраїнському, а й на міжнародному рівнях. Також я два роки була старостою та ще три - заступницею, тому я добре знаю що таке відповідальність, вміння комунікувати і організація різних процесів - старша в сім\'ї та була капітаном у різних командних змаганнях, тому маю досвід ще з дитинства. Якщо менш офіційно про мене - я з фізмату, люблю ходити в зал, подорожувати, погуляти і поспати, займалася тенісом, також люблю тварин - маю собаку, кішку і папугу.',
			description: 'Хочу стати представницею, бо мені цікаво бути голосом нашої групи та впливати на те, яким буде наше студентське життя. Я готова вислуховувати ідеї, вимоги та пропозиції нашої групи, доносити їх до Ради студентів та відстоювати наші інтереси. Також хочу піднімати важливі для нас питання, допомагати знаходити рішення та ініціювати нові ідеї й можливості для групи. Мені хочеться бути максимально залученою в життя групи й зробити так, щоб всі ідеї, не залишалися лише ідеями, а проблеми і прохання були вирішені.',
			image: 'https://lh3.googleusercontent.com/d/1E-OfhV5EbuTTWlHL_CL7KrQXvpm4Ym9w'
			},
			{
			id: '51',
			name: 'Книш Софія',
			shortDescription: 'Всім привіт, мене звати Софія, або можна просто Софа, і я з радістю взяла б на себе обов\'язки представника спеціальності. Я маю досвід старости та лідерських ролей в позашкільних проєктах, а також роботи в учнівському парламенті. Активна, доброзичлива, відповідальна та креативна – так описують мене мої друзі. А також я обожнюю авокадо.',
			description: 'Я бажаю стати тим самим містком, який допоможе доносити ваші думки та пропозиції до викладачів та асистентів. Думка кожного студента має бути почутою, і я готова з цим допомогти, незважаючи на те, чи стосується це несправедливого оцінювання, чи ідей щодо проведення часу разом у позанавчальний час. Я вважаю, що наші студентські роки в УКУ мають бути комфортними, радісними та щасливими, і я готова зробити все, щоб саме так ви про них згадували.',
			image: 'https://lh3.googleusercontent.com/d/1-2CVzsZ5qibqjYelrbtwMh389sthdFO5'
			},
		]},
		{
		id: 'komp-iuterni-nauki-2',
		specialty: "Комп'ютерні науки",
		course: 2,
		candidates: [
			{
			id: '44',
			name: 'Шимушовська Христина',
			description: 'Для мене важливо, щоб мої одногрупники мали змогу бути почутими та не боялися говорити про проблеми, з якими стикаються під час навчання. За час роботи представницею я зрозуміла, наскільки важливо, щоб у групі була людина, до якої можна звернутися із запитанням чи проблемою, та бути впевненим, що тобі допоможуть. Я хочу продовжити допомагати своїм одногрупникам і разом знаходити рішення проблем. Вважаю, що моя відкритість, досвід, відповідальність та вміння комунікувати допоможуть мені й надалі гідно представляти інтереси нашої групи',
			image: 'https://lh3.googleusercontent.com/d/1zsAbG75rr5OpY-QVm1hx9hIyb9JtLYB1'
			},
		]},
		{
		id: 'komp-iuterni-nauki-3',
		specialty: "Комп'ютерні науки",
		course: 3,
		candidates: [
			{
			id: '7',
			name: 'Магарита Ія',
			shortDescription: 'Мама потоку, вже в пенсійному віці, але досі намагаюсь покращити університетське життя своїх колег і коліжанок',
			description: 'Я досі прагну полегшувати комунікацію своєї академ. групи з адміністрацією університету. Хочу, аби їх думки чули, аби кожного з них бачили. Аби наша група могла впливати на рішення в університеті, а ФПН розвивався. Також для мене важливе місце в РС УКУ, бо я дуже хочу вносити технологічні зміни та автоматизацію в студ. самоврядування. :=)',
			image: 'https://lh3.googleusercontent.com/d/136RNxhl3MOGT3PjyR23intKRacTwlN-U'
			},
		]},
		{
		id: 'it-ta-analitika-rishen-1',
		specialty: 'Іт та аналітика рішень',
		course: 1,
		candidates: [
			{
			id: '6',
			name: 'Сабадах Роман',
			shortDescription: 'Хелоу! Я Рома з Тернополя 👋 Пластун з 2015 року, люблю спорт і завжди готовий брати на себе відповідальність. Вмію слухати людей, чути різні думки та знаходити спільну мову.',
			description: 'Моя мотивація — проявити себе як лідер, в новому колективі. Готовий бути на зв’язку, збирати ваші пропозиції та проблеми, нормально комунікувати з усіма й, головне, не просто передавати інформацію, а допомагати знаходити рішення. Думаю, зможемо зробити так, щоб наша група була почута🙌',
			image: 'https://lh3.googleusercontent.com/d/1BjeSzQ24vVKrT7mHcwt0f27DcjvsjDOl'
			},
			{
			id: '12',
			name: 'Бондаренко Владислава ',
			shortDescription: 'Я студентка УКУ, і для мене цей статус є важливим, адже саме він підтверджує всі мої старання, досягнення та прагнення бути частиною цієї спільноти. Я завжди була активною учасницею шкільного життя: тривалий час була старостою класу та брала участь у шкільному самоврядуванні. Крім того, перемогла в конкурсі стартапів Сікорського та була учасницею ГО «Патріот». У вільний час люблю читати книги та писати власні твори.',
			description: 'Я маю досвід відповідальності за команду: тривалий час була старостою класу, брала участь у шкільному самоврядуванні, а також очолювала групу під час роботи над стартап-проєктом. Цей досвід навчив мене брати на себе відповідальність, слухати інших, організовувати спільну роботу та представляти інтереси команди. Саме ці навички, на мою думку, є важливими для представника, як для лиця групи.',
			image: 'https://lh3.googleusercontent.com/d/1z3_-6JlQFbNG3RN9Z1cPRGiE2Sx5Kyjp'
			},
			{
			id: '52',
			name: 'Бартошук Даніела',
			shortDescription: 'Привіт усім, мене звати Даніела і я навчаюсь на програмі "ІТ та аналітика рішень". Чому саме ця програма? На мою думку, ІТ, економіка та математика є дуже цікавими та перспективними у сучасному світі, тому і вирішила спробувати поєднання цих напрямків у програмі.\nА тепер ще кілька фактів про мене: я з Рівного, тому проживаю у Колегіумі; з дитинства захоплююсь малюванням (також пробувала багато інших хобі: гончарство, співи, плавання...); мені дуже подобається придумувати та реалізовувати ідеї (від того, як круто привітати друзів у їх День народження, і до різноманітних ідей для участі у проєктах та конкурсах:)',
			description: 'Привіт!!! Я переконана, що кожному з нас дуже важливе навчання, проте кожен також хоче взяти максимум як корисних знань і навичок, так і, звісно ж, приємних спогадів, та на повну відчути студентське життя. Мені дуже важливо, щоб усі почувалися комфортно та не хвилювалися попросити про допомогу, запропонувати нову ідею чи розв\'язати разом дискретку:) Я готова брати активну участь у покращенні життя нашої групи та разом із вами пропонувати нові ідеї для удосконалення нашого навчання в УКУ!',
			image: 'https://lh3.googleusercontent.com/d/1KCFe5vf7ROFoAQaKroNC5AL-2UzLCuVX'
			},
		]},
		{
		id: 'it-ta-analitika-rishen-2',
		specialty: 'Іт та аналітика рішень',
		course: 2,
		candidates: [
			{
			id: '2',
			name: 'Лем Анастасія',
			shortDescription: 'Я була вашою старостою весь перший курс, тому думаю ви мене знаєте. Я асистент у другому семестрі з матану. У мене є класний кіт Левчик.',
			description: 'Припускаю, що я маю таку ж мотивацію як і на першому курсі. Думаю далі організувати якісь поїздки на фпн. А також комунікувати з викладачами.',
			image: 'https://lh3.googleusercontent.com/d/1j6jMsHfhdSkW4zVbOJpDjSGB1mh64L15'
			},
		]},
		{
		id: 'robototekhnika-2',
		specialty: 'Робототехніка',
		course: 2,
		candidates: [
			{
			id: '43',
			name: 'Березнюк Дарина',
			shortDescription: 'Людина, яка за будь-який двіж, що в секунду перемикається у відповідальну версію себе. Я готова слухати своїй одногрупників і передавати загальну думку викладачам, аби покращити навчальний процес.',
			description: 'Минулий рік дав мені зрозуміти, що бути представницею — це моє. Цього року хочу так само відповідати за свою групу, бути певним мостом між викладачами та моїми одногрупниками. Той досвід, що я отримала, був дуже важливим для мене, що вперше прийшла в університет, і я хочу отримати новий, будучи вже на другому курсі.',
			image: 'https://lh3.googleusercontent.com/d/1oKwcsCPTiRxE7faydmm5rW5OfaHgKZsl'
			},
		]},
]},
{
	id: 'law',
	name: 'Права',
	positions: [
		{
		id: 'pravo-1',
		specialty: 'Право',
		course: 1,
		candidates: [
			{
			id: '35',
			name: 'Грицик Соломія',
			shortDescription: 'Маю кота Лею; \nУ школі з восьмого класу була в самоврядуванні, у 10 класі мене вибрали президенткою парламенту;\nМаю музичну освіту',
			description: 'Відкрита до спілкування, люблю і вмію добре комунікувати з людьми. Дууже хочу продовжити свою активну діяльність у парламентах. Хочу, аби в групі була врахована думка кожного при вирішенні якихось питань чи голосування в раді, до прикладу.',
			image: 'https://lh3.googleusercontent.com/d/17NyMhqi-b4tOI17fdEJl88GzT95tAWWM'
			},
			{
			id: '37',
			name: 'Мищишин Ярина',
			shortDescription: 'Я з міста Львів, 17 років, закінчила Львівську Лінгвістичну Гімназію і зараз навчаюся на першому курсі факультету права. Раніше професійно займалася плаванням, а також брала участь у Пласті та різних молодіжних заходах. Дуже люблю працювати в команді, організовувати процеси та знайомитися з новими людьми',
			description: 'Я хочу стати представницею Ради студентів, тому що хочу бути активною частиною студентського життя УКУ та представляти інтереси свого курсу. Мені важливо не лише висловлювати власну думку, а й чути інших студентів та допомагати знаходити рішення, які враховуватимуть їхні потреби. Мені було б дуже приємно робити навчання в університеті приємним та легким',
			image: 'https://lh3.googleusercontent.com/d/1rujnoTlzS8HvydxadYjrJTlcI4AKLMaR'
			},
			{
			id: '41',
			name: 'Макух Денис',
			shortDescription: 'Я простий львівський хлопець.Люблю спорт та добре відпочити після пар.Душевно відкрита людина.',
			description: 'Моя мотивація полягає у забезпеченні порядку та стабільності на нашому курсі.Багатьох моїх однокурсників я знаю і вони мене також ,тобто полагодити ми зможемо.Я практично завжди онлайн ,тому тільки за певних обставин можу буду поза мережою.Тому якщо щось треба вирішити або допомогти -звертайтесь до мене.',
			image: 'https://lh3.googleusercontent.com/d/1XccNE6AYslM0gW3fJ1HNiQz7wXrcc0c0'
			},
			{
			id: '53',
			name: 'Яковчук Евеліна ',
			shortDescription: 'З академічних й громадських досягнень маю досвід в написанні наукових робіт, приймала участь в багатьох олімпіадах. Буда членкинею Молодіжної ради Камʼянського. Активно займаюсь волонтерською діяльністю, працювала з дітьми з інклюзією. На меті мала вступити на право, оскільки сама є справедливою, розсудливою й відповідальною. До людей ставлюсь з такою ж повагою й із задоволенням готова прийти на допомогу й вислухати прохання та ідеї кожного.',
			description: 'Моя мотивація є простою - допомагати розвиватись факультету, університету, підтримувати людей, які зі мною стали на цей захопливий шлях. Моя ціль -  розвивати ще більше навички комунікації, лідерства й хочу щоб мої пропозиції та ідеї моїх однокурсників будували краще майбутнє України.',
			image: 'https://lh3.googleusercontent.com/d/1fT3qdGETxgo2qqumvJrVIbAmrk-UBKKS'
			},
		]},
		{
		id: 'pravo-2',
		specialty: 'Право',
		course: 2,
		candidates: [
			{
			id: '42',
			name: 'Муринюк Наталія ',
			shortDescription: 'Привіт! Я вже рік була старостою групи та замісником представника курсу, тому думаю що добре впораюсь з цим завданням. Ви завжди можете до мене звернутись за допомогою чи за розмовою.🫶🏻',
			description: 'Хочу стати представником бо вже розумію як все працює, вмію налагоджувати контакт з викладачами та студентами. Хочу зробити навчальний процес своїх однокурсників легшим та приємнішим.',
			image: 'https://lh3.googleusercontent.com/d/1lqsWV-rXqXCcUxIGB4D8SIlxzuKoR28I'
			},
		]},
		{
		id: 'pravo-3',
		specialty: 'Право',
		course: 3,
		candidates: [
			{
			id: '30',
			name: 'Левчук Марія',
			description: 'Хочу стати представником групи, бо мені комфортно брати на себе організаційні питання та комунікувати з людьми. Я відповідальна, уважна до деталей і вмію швидко вирішувати робочі моменти. Думаю, що зможу правильно представляти інтереси групи та підтримувати зручну комунікацію між студентами й викладачами.',
			image: 'https://lh3.googleusercontent.com/d/1HTzcQulv8lqdUQ7Ai5kwNNOWOcgH5_HA'
			},
			{
			id: '39',
			name: 'Лєсьо Софія ',
			shortDescription: 'Я активна учасниця студентської спільноти. Маю досвід в роботі з групами та організацією подій. Завдяки роботі в громадських організаціях українських та міжнародних спільнот маю великий досвід в комунікації.',
			description: 'Моя мотивація це моя група та бажання створити комфортну атмосферу в ній як для студентів, так і для викладачів. Також, розумію, що університет старається бути поближче до студентів та потребує такого голосу. Завдяки своєму досвіду в Раді студентів, я розумію як такі пропозиції висловлювати організовувати їх імплементацію.',
			image: 'https://lh3.googleusercontent.com/d/1jbnA4K5lBhI7TZ2pbLpaAy1qeNAC7Ud8'
			},
		]},
		{
		id: 'pravo-magistratura-1',
		specialty: 'Право (магістратура)',
		course: 1,
		candidates: [
			{
			id: '5',
			name: 'Бабляк Олена',
			shortDescription: 'ідеальна особа на посаду представниці. із мінусів - не вмію підключати проектор в авдиторіях, але це виправимо',
			description: 'знаю багато анекдотів і особа не конфліктна',
			image: 'https://lh3.googleusercontent.com/d/1jKWMp1SAE6LEm5DMPCHc6AScJztFzSal'
			},
		]},
		{
		id: 'pravo-magistratura-2',
		specialty: 'Право (магістратура)',
		course: 2,
		candidates: [
			{
			id: '36',
			name: 'Довгун Іван',
			description: 'Лишитись на посаді',
			image: 'https://lh3.googleusercontent.com/d/1Jhlmt1tCmE1LSRfIPwfb3wXWUUU791UA'
			},
		]},
]},
{
	id: 'business-school',
	name: 'Бізнес-школа',
	positions: [
		{
		id: 'menedzhment-marketingovoyi-diial-nosti-1',
		specialty: 'Менеджмент маркетингової діяльності',
		course: 1,
		candidates: [
			{
			id: '23',
			name: 'Саврук Олена',
			shortDescription: 'Працюю комунікаційницею для мережі «Твори» — мережі молодіжних просторів та ініціатив у Львові, яка створює можливості для молоді, розвиває молодіжну політику та реалізовує великі всеукраїнські заходи, наприклад, «Молодвіж».\n\nУже кілька років займаюся комунікаціями, молодіжними ініціативами, організацією подій та веденням комерційних проєктів. Люблю працювати з людьми, запускати нові проєкти, що  та втілювати ідеї в життя.\n\nНайкращий відпочинок для мене — втеча в гори на кілька днів із близькими. Там я перезавантажуюся й повертаюся до Львова з новими силами та ідеями.',
			description: 'Цього року випустилася з політології в УКУ. Під час навчання активно долучалася до студентського самоврядування: працювала комунікаційницею Уряду студентів, дизайнеркою Медіаблоку УКУ, була учасницею Братства УКУ та волонтерила в інших проєктах.\n\nВ Уряді ми регулярно співпрацювали з Радою студентів, тому я добре розумію її роботу та внутрішні процеси. Цей досвід дав мені ширше бачення університетського життя й потреб студентів.\n\nСаме тому хочу долучитися до Ради й бути корисною в роботі над питаннями, які безпосередньо стосуються студентської спільноти.',
			image: 'https://lh3.googleusercontent.com/d/1mZJQW3vDzPs8OuwOok3H3da0swmB1Nfw'
			},
		]},
		{
		id: 'upravlinnia-organizatsiiami-iaki-vplivaiut-1',
		specialty: 'Управління організаціями які впливають',
		course: 1,
		candidates: [
			{
			id: '21',
			name: 'Решетков Олександр',
			shortDescription: 'Я навчаюся на магістерській програмі з управління організаціями, що створюють суспільний вплив, в УКУ. Уже понад вісім років працюю з громадськими, молодіжними та гуманітарними проєктами, а також заснував мережу молодіжних просторів aWARe Zone. Люблю об’єднувати людей навколо спільних ідей, організовувати події та перетворювати ініціативи на реальні проєкти. Після довгої перерви в академічному навчанні хочу не лише наздоганяти, а й активно долучатися до життя університетської спільноти.',
			description: 'Я хочу, щоб голос студентів нашої програми був почутий, а комунікація між студентами, викладачами та адміністрацією була відкритою і результативною. Маю значний досвід представлення інтересів різних спільнот, ведення переговорів та організації командної роботи. Умію слухати, знаходити спільну мову з різними людьми й доводити справи до конкретного результату. Вважаю, що мій досвід та енергія допоможуть зробити студентське життя активнішим, комфортнішим і цікавішим для всіх.',
			image: 'https://lh3.googleusercontent.com/d/1OMj3olPmVkTrs9M773HbxU0uZVZpxCkF'
			},
			{
			id: '38',
			name: 'Липинський Олександр Олександрович',
			shortDescription: 'Випускник Етики-Політики-Економіки в УКУ 2026р.\nПластун\n8-й Президент Уряду студентів УКУ (2024 – 2025рр.)\nЧлен виконавчого комітету Національного студентського об\'єднання "Українська асоціація студентів" (УАС) із питань взаємодії з органами влади (травень 2025р. – вересень 2026р.)\nЧлен Правління Національного українського молодіжного об\'єднання (НУМО) (березень 2026р. – донині)\nАвтор дослідження "Перспективи інституціоналізації студентського самоврядування в Україні у законодавчому полі" і проєкту законопроєкту "Про студентське самоврядування" (2026)',
			description: 'Хочу стати містком між нашою програмою УОВ Бізнес-школи і студентським самоврядування УКУ. Хочу бути активним учасником дискусій у Раді студентів, використовувати весь свій накопичений досвід для покращення ОСС УКУ.',
			image: 'https://lh3.googleusercontent.com/d/1n2n5k6XOKd10fsh37XLT1r6qZ8jaqMmc'
			},
		]},
]},
];

// Helper functions to extract data for different use cases
export const getCandidatesForPosition = (
  facultyId: string, 
  specialty: string, 
  course: number
): VotingCandidate[] => {
  const faculty = allCandidatesData.find(f => f.id === facultyId);
  if (!faculty) return [];
  
  const position = faculty.positions.find(p => 
    p.specialty === specialty && p.course === course
  );
  return position ? position.candidates : [];
};

export const getPositionsByFaculty = (facultyId: string): Position[] => {
  const faculty = allCandidatesData.find(f => f.id === facultyId);
  return faculty ? faculty.positions : [];
};
